OpenROAD 26Q1-2290-g4589d89a40 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 16 thread(s).
read_liberty /OpenROAD-flow-scripts/flow/platforms/sky130hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
read_db ./results/sky130hd/dot_product/base/2_1_floorplan.odb
read_sdc ./results/sky130hd/dot_product/base/2_1_floorplan.sdc
source /OpenROAD-flow-scripts/flow/platforms/sky130hd/setRC.tcl
No macros found: Skipping macro_placement
Design area 24863 um^2 10% utilization.
write_db ./results/sky130hd/dot_product/base/2_2_floorplan_macro.odb
Elapsed time: 0:00.41[h:]min:sec. CPU time: user 0.33 sys 0.05 (93%). Peak memory: 124056KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
2_2_floorplan_macro                0            121 9c95647efa1bb19a9c72
