OpenROAD 26Q1-2290-g4589d89a40 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 16 thread(s).
read_liberty /OpenROAD-flow-scripts/flow/platforms/sky130hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
read_db ./results/sky130hd/dot_product/base/5_2_route.odb
read_sdc ./results/sky130hd/dot_product/base/5_1_grt.sdc
source /OpenROAD-flow-scripts/flow/platforms/sky130hd/setRC.tcl
filler_placement "sky130_fd_sc_hd__fill_1 sky130_fd_sc_hd__fill_2 sky130_fd_sc_hd__fill_4 sky130_fd_sc_hd__fill_8"
[INFO DPL-0001] Placed 27562 filler instances.
Design area 34294 um^2 14% utilization.
write_db ./results/sky130hd/dot_product/base/5_3_fillcell.odb
Elapsed time: 0:00.57[h:]min:sec. CPU time: user 0.48 sys 0.08 (99%). Peak memory: 163692KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
5_3_fillcell                       0            159 c61c2e08e13f3a1f2bef
