OpenROAD 26Q1-2290-g4589d89a40 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 16 thread(s).
read_liberty /OpenROAD-flow-scripts/flow/platforms/sky130hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
read_db ./results/sky130hd/dot_product/base/5_route.odb
read_sdc ./results/sky130hd/dot_product/base/5_route.sdc
source /OpenROAD-flow-scripts/flow/platforms/sky130hd/setRC.tcl
exec cp ./results/sky130hd/dot_product/base/5_route.odb ./results/sky130hd/dot_product/base/6_1_fill.odb
Elapsed time: 0:00.45[h:]min:sec. CPU time: user 0.35 sys 0.10 (99%). Peak memory: 147328KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
6_1_fill                           0            143 c61c2e08e13f3a1f2bef
