# Yosys Synthesis Script with Sky130 Safe Cells
# Module: seq_detector_0011
# Safe cell count: 275

read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a2111o/sky130_fd_sc_hd__a2111o_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a2111o/sky130_fd_sc_hd__a2111o_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a2111o/sky130_fd_sc_hd__a2111o_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a2111oi/sky130_fd_sc_hd__a2111oi_0.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a2111oi/sky130_fd_sc_hd__a2111oi_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a2111oi/sky130_fd_sc_hd__a2111oi_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a2111oi/sky130_fd_sc_hd__a2111oi_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a211o/sky130_fd_sc_hd__a211o_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a211o/sky130_fd_sc_hd__a211o_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a211o/sky130_fd_sc_hd__a211o_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a211oi/sky130_fd_sc_hd__a211oi_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a211oi/sky130_fd_sc_hd__a211oi_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a211oi/sky130_fd_sc_hd__a211oi_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a21bo/sky130_fd_sc_hd__a21bo_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a21bo/sky130_fd_sc_hd__a21bo_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a21bo/sky130_fd_sc_hd__a21bo_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a21boi/sky130_fd_sc_hd__a21boi_0.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a21boi/sky130_fd_sc_hd__a21boi_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a21boi/sky130_fd_sc_hd__a21boi_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a21boi/sky130_fd_sc_hd__a21boi_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a21o/sky130_fd_sc_hd__a21o_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a21o/sky130_fd_sc_hd__a21o_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a21o/sky130_fd_sc_hd__a21o_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a21oi/sky130_fd_sc_hd__a21oi_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a21oi/sky130_fd_sc_hd__a21oi_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a21oi/sky130_fd_sc_hd__a21oi_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a221o/sky130_fd_sc_hd__a221o_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a221o/sky130_fd_sc_hd__a221o_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a221o/sky130_fd_sc_hd__a221o_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a221oi/sky130_fd_sc_hd__a221oi_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a221oi/sky130_fd_sc_hd__a221oi_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a221oi/sky130_fd_sc_hd__a221oi_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a22o/sky130_fd_sc_hd__a22o_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a22o/sky130_fd_sc_hd__a22o_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a22o/sky130_fd_sc_hd__a22o_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a22oi/sky130_fd_sc_hd__a22oi_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a22oi/sky130_fd_sc_hd__a22oi_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a22oi/sky130_fd_sc_hd__a22oi_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a2bb2o/sky130_fd_sc_hd__a2bb2o_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a2bb2o/sky130_fd_sc_hd__a2bb2o_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a2bb2o/sky130_fd_sc_hd__a2bb2o_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a2bb2oi/sky130_fd_sc_hd__a2bb2oi_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a2bb2oi/sky130_fd_sc_hd__a2bb2oi_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a2bb2oi/sky130_fd_sc_hd__a2bb2oi_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a311o/sky130_fd_sc_hd__a311o_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a311o/sky130_fd_sc_hd__a311o_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a311o/sky130_fd_sc_hd__a311o_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a311oi/sky130_fd_sc_hd__a311oi_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a311oi/sky130_fd_sc_hd__a311oi_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a311oi/sky130_fd_sc_hd__a311oi_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a31o/sky130_fd_sc_hd__a31o_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a31o/sky130_fd_sc_hd__a31o_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a31o/sky130_fd_sc_hd__a31o_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a31oi/sky130_fd_sc_hd__a31oi_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a31oi/sky130_fd_sc_hd__a31oi_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a31oi/sky130_fd_sc_hd__a31oi_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a32o/sky130_fd_sc_hd__a32o_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a32o/sky130_fd_sc_hd__a32o_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a32o/sky130_fd_sc_hd__a32o_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a32oi/sky130_fd_sc_hd__a32oi_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a32oi/sky130_fd_sc_hd__a32oi_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a32oi/sky130_fd_sc_hd__a32oi_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a41o/sky130_fd_sc_hd__a41o_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a41o/sky130_fd_sc_hd__a41o_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a41o/sky130_fd_sc_hd__a41o_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a41oi/sky130_fd_sc_hd__a41oi_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a41oi/sky130_fd_sc_hd__a41oi_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/a41oi/sky130_fd_sc_hd__a41oi_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/and2/sky130_fd_sc_hd__and2_0.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/and2/sky130_fd_sc_hd__and2_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/and2/sky130_fd_sc_hd__and2_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/and2/sky130_fd_sc_hd__and2_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/and2b/sky130_fd_sc_hd__and2b_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/and2b/sky130_fd_sc_hd__and2b_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/and2b/sky130_fd_sc_hd__and2b_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/and3/sky130_fd_sc_hd__and3_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/and3/sky130_fd_sc_hd__and3_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/and3/sky130_fd_sc_hd__and3_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/and3b/sky130_fd_sc_hd__and3b_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/and3b/sky130_fd_sc_hd__and3b_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/and3b/sky130_fd_sc_hd__and3b_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/and4/sky130_fd_sc_hd__and4_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/and4/sky130_fd_sc_hd__and4_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/and4/sky130_fd_sc_hd__and4_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/and4b/sky130_fd_sc_hd__and4b_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/and4b/sky130_fd_sc_hd__and4b_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/and4b/sky130_fd_sc_hd__and4b_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/and4bb/sky130_fd_sc_hd__and4bb_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/and4bb/sky130_fd_sc_hd__and4bb_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/and4bb/sky130_fd_sc_hd__and4bb_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/buf/sky130_fd_sc_hd__buf_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/buf/sky130_fd_sc_hd__buf_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/buf/sky130_fd_sc_hd__buf_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/buf/sky130_fd_sc_hd__buf_6.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/buf/sky130_fd_sc_hd__buf_8.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/bufbuf/sky130_fd_sc_hd__bufbuf_8.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/bufinv/sky130_fd_sc_hd__bufinv_8.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/clkbuf/sky130_fd_sc_hd__clkbuf_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/clkbuf/sky130_fd_sc_hd__clkbuf_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/clkbuf/sky130_fd_sc_hd__clkbuf_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/clkbuf/sky130_fd_sc_hd__clkbuf_8.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/clkinv/sky130_fd_sc_hd__clkinv_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/clkinv/sky130_fd_sc_hd__clkinv_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/clkinv/sky130_fd_sc_hd__clkinv_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/clkinv/sky130_fd_sc_hd__clkinv_8.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/clkinvlp/sky130_fd_sc_hd__clkinvlp_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/clkinvlp/sky130_fd_sc_hd__clkinvlp_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/conb/sky130_fd_sc_hd__conb_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/decap/sky130_fd_sc_hd__decap_3.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/decap/sky130_fd_sc_hd__decap_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/decap/sky130_fd_sc_hd__decap_6.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/decap/sky130_fd_sc_hd__decap_8.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/fill/sky130_fd_sc_hd__fill_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/fill/sky130_fd_sc_hd__fill_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/fill/sky130_fd_sc_hd__fill_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/fill/sky130_fd_sc_hd__fill_8.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/ha/sky130_fd_sc_hd__ha_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/ha/sky130_fd_sc_hd__ha_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/ha/sky130_fd_sc_hd__ha_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/inv/sky130_fd_sc_hd__inv_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/inv/sky130_fd_sc_hd__inv_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/inv/sky130_fd_sc_hd__inv_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/inv/sky130_fd_sc_hd__inv_6.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/inv/sky130_fd_sc_hd__inv_8.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/nand2/sky130_fd_sc_hd__nand2_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/nand2/sky130_fd_sc_hd__nand2_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/nand2/sky130_fd_sc_hd__nand2_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/nand2/sky130_fd_sc_hd__nand2_8.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/nand2b/sky130_fd_sc_hd__nand2b_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/nand2b/sky130_fd_sc_hd__nand2b_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/nand2b/sky130_fd_sc_hd__nand2b_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/nand3/sky130_fd_sc_hd__nand3_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/nand3/sky130_fd_sc_hd__nand3_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/nand3/sky130_fd_sc_hd__nand3_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/nand3b/sky130_fd_sc_hd__nand3b_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/nand3b/sky130_fd_sc_hd__nand3b_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/nand3b/sky130_fd_sc_hd__nand3b_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/nand4/sky130_fd_sc_hd__nand4_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/nand4/sky130_fd_sc_hd__nand4_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/nand4/sky130_fd_sc_hd__nand4_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/nand4b/sky130_fd_sc_hd__nand4b_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/nand4b/sky130_fd_sc_hd__nand4b_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/nand4b/sky130_fd_sc_hd__nand4b_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/nand4bb/sky130_fd_sc_hd__nand4bb_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/nand4bb/sky130_fd_sc_hd__nand4bb_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/nand4bb/sky130_fd_sc_hd__nand4bb_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/nor2/sky130_fd_sc_hd__nor2_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/nor2/sky130_fd_sc_hd__nor2_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/nor2/sky130_fd_sc_hd__nor2_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/nor2/sky130_fd_sc_hd__nor2_8.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/nor2b/sky130_fd_sc_hd__nor2b_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/nor2b/sky130_fd_sc_hd__nor2b_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/nor2b/sky130_fd_sc_hd__nor2b_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/nor3/sky130_fd_sc_hd__nor3_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/nor3/sky130_fd_sc_hd__nor3_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/nor3/sky130_fd_sc_hd__nor3_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/nor3b/sky130_fd_sc_hd__nor3b_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/nor3b/sky130_fd_sc_hd__nor3b_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/nor3b/sky130_fd_sc_hd__nor3b_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/nor4/sky130_fd_sc_hd__nor4_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/nor4/sky130_fd_sc_hd__nor4_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/nor4/sky130_fd_sc_hd__nor4_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/nor4b/sky130_fd_sc_hd__nor4b_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/nor4b/sky130_fd_sc_hd__nor4b_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/nor4b/sky130_fd_sc_hd__nor4b_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/nor4bb/sky130_fd_sc_hd__nor4bb_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/nor4bb/sky130_fd_sc_hd__nor4bb_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/nor4bb/sky130_fd_sc_hd__nor4bb_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o2111a/sky130_fd_sc_hd__o2111a_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o2111a/sky130_fd_sc_hd__o2111a_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o2111a/sky130_fd_sc_hd__o2111a_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o2111ai/sky130_fd_sc_hd__o2111ai_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o2111ai/sky130_fd_sc_hd__o2111ai_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o2111ai/sky130_fd_sc_hd__o2111ai_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o211a/sky130_fd_sc_hd__o211a_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o211a/sky130_fd_sc_hd__o211a_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o211a/sky130_fd_sc_hd__o211a_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o211ai/sky130_fd_sc_hd__o211ai_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o211ai/sky130_fd_sc_hd__o211ai_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o211ai/sky130_fd_sc_hd__o211ai_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o21a/sky130_fd_sc_hd__o21a_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o21a/sky130_fd_sc_hd__o21a_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o21a/sky130_fd_sc_hd__o21a_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o21ai/sky130_fd_sc_hd__o21ai_0.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o21ai/sky130_fd_sc_hd__o21ai_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o21ai/sky130_fd_sc_hd__o21ai_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o21ai/sky130_fd_sc_hd__o21ai_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o21ba/sky130_fd_sc_hd__o21ba_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o21ba/sky130_fd_sc_hd__o21ba_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o21ba/sky130_fd_sc_hd__o21ba_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o21bai/sky130_fd_sc_hd__o21bai_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o21bai/sky130_fd_sc_hd__o21bai_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o21bai/sky130_fd_sc_hd__o21bai_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o221a/sky130_fd_sc_hd__o221a_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o221a/sky130_fd_sc_hd__o221a_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o221a/sky130_fd_sc_hd__o221a_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o221ai/sky130_fd_sc_hd__o221ai_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o221ai/sky130_fd_sc_hd__o221ai_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o221ai/sky130_fd_sc_hd__o221ai_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o22a/sky130_fd_sc_hd__o22a_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o22a/sky130_fd_sc_hd__o22a_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o22a/sky130_fd_sc_hd__o22a_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o22ai/sky130_fd_sc_hd__o22ai_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o22ai/sky130_fd_sc_hd__o22ai_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o22ai/sky130_fd_sc_hd__o22ai_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o2bb2a/sky130_fd_sc_hd__o2bb2a_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o2bb2a/sky130_fd_sc_hd__o2bb2a_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o2bb2a/sky130_fd_sc_hd__o2bb2a_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o2bb2ai/sky130_fd_sc_hd__o2bb2ai_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o2bb2ai/sky130_fd_sc_hd__o2bb2ai_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o2bb2ai/sky130_fd_sc_hd__o2bb2ai_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o311a/sky130_fd_sc_hd__o311a_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o311a/sky130_fd_sc_hd__o311a_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o311a/sky130_fd_sc_hd__o311a_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o311ai/sky130_fd_sc_hd__o311ai_0.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o311ai/sky130_fd_sc_hd__o311ai_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o311ai/sky130_fd_sc_hd__o311ai_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o311ai/sky130_fd_sc_hd__o311ai_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o31a/sky130_fd_sc_hd__o31a_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o31a/sky130_fd_sc_hd__o31a_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o31a/sky130_fd_sc_hd__o31a_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o31ai/sky130_fd_sc_hd__o31ai_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o31ai/sky130_fd_sc_hd__o31ai_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o31ai/sky130_fd_sc_hd__o31ai_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o32a/sky130_fd_sc_hd__o32a_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o32a/sky130_fd_sc_hd__o32a_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o32a/sky130_fd_sc_hd__o32a_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o32ai/sky130_fd_sc_hd__o32ai_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o32ai/sky130_fd_sc_hd__o32ai_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o32ai/sky130_fd_sc_hd__o32ai_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o41a/sky130_fd_sc_hd__o41a_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o41a/sky130_fd_sc_hd__o41a_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o41a/sky130_fd_sc_hd__o41a_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o41ai/sky130_fd_sc_hd__o41ai_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o41ai/sky130_fd_sc_hd__o41ai_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/o41ai/sky130_fd_sc_hd__o41ai_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/or2/sky130_fd_sc_hd__or2_0.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/or2/sky130_fd_sc_hd__or2_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/or2/sky130_fd_sc_hd__or2_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/or2/sky130_fd_sc_hd__or2_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/or2b/sky130_fd_sc_hd__or2b_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/or2b/sky130_fd_sc_hd__or2b_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/or2b/sky130_fd_sc_hd__or2b_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/or3/sky130_fd_sc_hd__or3_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/or3/sky130_fd_sc_hd__or3_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/or3/sky130_fd_sc_hd__or3_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/or3b/sky130_fd_sc_hd__or3b_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/or3b/sky130_fd_sc_hd__or3b_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/or3b/sky130_fd_sc_hd__or3b_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/or4/sky130_fd_sc_hd__or4_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/or4/sky130_fd_sc_hd__or4_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/or4/sky130_fd_sc_hd__or4_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/or4b/sky130_fd_sc_hd__or4b_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/or4b/sky130_fd_sc_hd__or4b_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/or4b/sky130_fd_sc_hd__or4b_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/or4bb/sky130_fd_sc_hd__or4bb_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/or4bb/sky130_fd_sc_hd__or4bb_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/or4bb/sky130_fd_sc_hd__or4bb_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/tap/sky130_fd_sc_hd__tap_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/tap/sky130_fd_sc_hd__tap_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/tapvgnd/sky130_fd_sc_hd__tapvgnd_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/tapvgnd2/sky130_fd_sc_hd__tapvgnd2_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/tapvpwrvgnd/sky130_fd_sc_hd__tapvpwrvgnd_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/xnor2/sky130_fd_sc_hd__xnor2_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/xnor2/sky130_fd_sc_hd__xnor2_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/xnor2/sky130_fd_sc_hd__xnor2_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/xnor3/sky130_fd_sc_hd__xnor3_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/xnor3/sky130_fd_sc_hd__xnor3_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/xnor3/sky130_fd_sc_hd__xnor3_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/xor2/sky130_fd_sc_hd__xor2_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/xor2/sky130_fd_sc_hd__xor2_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/xor2/sky130_fd_sc_hd__xor2_4.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/xor3/sky130_fd_sc_hd__xor3_1.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/xor3/sky130_fd_sc_hd__xor3_2.v
read_verilog skywater-pdk-libs-sky130_fd_sc_hd/cells/xor3/sky130_fd_sc_hd__xor3_4.v

read_verilog -sv rtl/seq_detector_0011.v

hierarchy -check -top seq_detector_0011
proc
opt
abc
opt_clean -purge
stat

write_verilog -noattr synthesized/seq_detector_0011_synth.v
