OpenROAD 26Q1-2290-g4589d89a40 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 16 thread(s).
read_liberty /OpenROAD-flow-scripts/flow/platforms/sky130hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
[INFO ODB-0227] LEF file: /OpenROAD-flow-scripts/flow/platforms/sky130hd/lef/sky130_fd_sc_hd.tlef, created 13 layers, 25 vias
[INFO ODB-0227] LEF file: /OpenROAD-flow-scripts/flow/platforms/sky130hd/lef/sky130_fd_sc_hd_merged.lef, created 441 library cells
link_design seq_detector_0011
read_sdc ./results/sky130hd/seq_detector_0011/base/1_2_yosys.sdc
source /OpenROAD-flow-scripts/flow/platforms/sky130hd/setRC.tcl
write_db ./results/sky130hd/seq_detector_0011/base/1_synth.odb
write_sdc -no_timestamp ./results/sky130hd/seq_detector_0011/base/1_synth.sdc
Elapsed time: 0:00.80[h:]min:sec. CPU time: user 0.75 sys 0.16 (113%). Peak memory: 122712KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
1_synth                            0            119 a9316c7fbe6c9550b91b
