OpenROAD 26Q1-2290-g4589d89a40 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 16 thread(s).
read_liberty /OpenROAD-flow-scripts/flow/platforms/sky130hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
read_db ./results/sky130hd/seq_detector_0011/base/2_1_floorplan.odb
read_sdc ./results/sky130hd/seq_detector_0011/base/2_1_floorplan.sdc
source /OpenROAD-flow-scripts/flow/platforms/sky130hd/setRC.tcl
No macros found: Skipping macro_placement
Design area 120 um^2 11% utilization.
write_db ./results/sky130hd/seq_detector_0011/base/2_2_floorplan_macro.odb
Elapsed time: 0:00.75[h:]min:sec. CPU time: user 0.66 sys 0.09 (100%). Peak memory: 120692KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
2_2_floorplan_macro                0            117 c7e64c99548ceb45e6d8
