OpenROAD 26Q1-2290-g4589d89a40 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 16 thread(s).
read_liberty /OpenROAD-flow-scripts/flow/platforms/sky130hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
read_db ./results/sky130hd/seq_detector_0011/base/2_3_floorplan_tapcell.odb
read_sdc ./results/sky130hd/seq_detector_0011/base/2_1_floorplan.sdc
source /OpenROAD-flow-scripts/flow/platforms/sky130hd/setRC.tcl
[INFO PDN-0001] Inserting grid: grid
Design area 138 um^2 12% utilization.
write_db ./results/sky130hd/seq_detector_0011/base/2_4_floorplan_pdn.odb
Elapsed time: 0:00.72[h:]min:sec. CPU time: user 0.71 sys 0.14 (117%). Peak memory: 122956KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
2_4_floorplan_pdn                  0            120 ad52eabf06ba16049e2c
